# StairsComponentConnection Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsComponentConnection Class
Members See Also
---
Represents information about a connection among stairs components(run to landing).
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class StairsComponentConnection : IDisposable
```

Visual Basic
---
```text
Public Class StairsComponentConnection _
	Implements IDisposable
```

Visual C++
---
```text
public ref class StairsComponentConnection : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Architecture..::..StairsComponentConnection
# See Also
StairsComponentConnection Members
Autodesk.Revit.DB.Architecture Namespace